//起動時の処理
function setup() {
    canvasSize(1080, 1264);
}

//メインループ
function mainloop() {
    drawBG();
}

var SIZE = 72;
var stage = [//通路のデータ
    [0,0,0,0,2,0,0,0,0,0,2,0,0,0,0],
    [4,2,0,0,4,4,2,0,0,2,3,0,0,2,3],
    [0,2,0,0,0,0,2,0,0,2,0,0,0,2,0],
    [0,2,0,0,0,0,2,0,0,2,0,0,0,2,0],
    [0,4,4,2,0,2,3,0,0,4,2,0,0,2,0],
    [0,0,0,2,0,2,0,0,0,0,4,2,0,2,0],
    [0,2,3,3,0,4,4,2,0,0,0,2,0,2,0],
    [0,2,0,0,0,0,0,2,0,0,2,3,0,2,0],
    [0,2,0,0,0,0,0,2,0,0,2,0,0,2,0],
    [0,2,0,0,0,0,0,2,0,0,2,0,0,2,0],
    [0,4,4,4,4,4,4,5,3,3,3,3,3,3,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
];
var arrow = ["", "↑", "↓", "←", "→", "Ｃ"];

function drawBG() {
    fill("navy");
    lineW(1);
    for(var y=0; y<12; y++) {
        for(var x=0; x<15; x++) {
            var cx = x*SIZE;
            var cy = y*SIZE;
            sRect(cx, cy, SIZE-2, SIZE-2, "silver");
            var c = stage[y][x];
            if(c > 0) {
                fRect(cx, cy, SIZE-2, SIZE-2, "white");
                fText(arrow[c], cx+SIZE/2, cy+SIZE/2, 30, "cyan");
            }
        }
    }
}